namespace ProgramType.Type
{
    /// <summary>
    /// Типы с плавающей точкой
    /// </summary>
    public class DoubleNumber
    {
        public DoubleNumber()
        {
            // 32 - битные целые числа с плавающей точкой
            /*
             * Диапазон: от ±-1,5 x 10^-45 до ±3,4 x 10^38
             * Точность: ~6-9 цифр
             * Размер: 4 байт
             */
            float pi = 3.14159f;


            // 64 - битные целые числа с плавающей точкой
            /*
             * Диапазон: от ±5,0 × 10^−324 до ±1,7 × 10^308
             * Точность: ~15-17 цифр
             * Размер: 4 байт
             */
            double e = 2.71828182845904;
        }
    }
}
