namespace AbstractionLibrary
{
    public class BaseAbstraction
    {

    //| Критерий               | Абстрактный класс                      		      | Интерфейс                                        |
    //|------------------------|------------------------------------------------------|--------------------------------------------------|
    //| Наследование           | Один базовый класс                                   | Множество интерфейсов                            |
    //| Реализация методов     | Может содержать реализованные и абстрактные методы   | Начиная с C# 8.0 могут содержать методы с        |
    //|                        |                                                      | реализацией по умолчанию                         |
    //| Состояние              | Может содержать поля                                 | Традиционно не содержит полей                    |
    //| Конструкторы           | Может иметь конструкторы                             | Не имеет конструкторов                           |
    //| Использование          | Для создания базовой функциональности                | Для определения контрактов и поведения           |
    //| Модификаторы доступа   | Различные уровни доступа                             | Члены по умолчанию публичные                     |

    }
}
